2023.09.05.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[https://alan.petitepomme.net/cwn/2023.08.29.html][Previous Week]] [[https://alan.petitepomme.net/cwn/index.html][Up]] [[https://alan.petitepomme.net/cwn/2023.09.12.html][Next Week]]

Hello

Here is the latest OCaml Weekly News, for the week of August 29 to September 05, 2023.

#+TOC: headlines 1


* iostream 0.1
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://discuss.ocaml.org/t/ann-iostream-0-1/12922/1

** Simon Cruanes announced


I've just released iostream 0.1. iostream is a [[https://github.com/c-cube/ocaml-iostream][library]] that provides
composable abstractions for input/output streams of bytes. Here composability means that users can create their own
streams, which makes a ~Iostream.Out.t~ more powerful than the standard ~out_channel~ because it is an abstraction
that might perform compression before writing to a ~Buffer.t~, or writes to a socket, or write nowhere, or send the
bytes to multiple other outputs.

There already exist some similar abstractions in the ecosystem, such as Batteries' ~BatIO~, an object based version
of this in ocamlnet, and probably uncountably many other projects. I have ancestor versions of this in many of my
own projects. This is my way of dealing with my failure to implement [[https://github.com/ocaml/RFCs/pull/19][RFC19]]
in OCaml itself (a worthy read about tradeoffs and use cases, for anyone interested). In other languages you can
find Rust's [[https://doc.rust-lang.org/std/io/trait.Read.html][Read]],
[[https://doc.rust-lang.org/std/io/trait.BufRead.html][BufRead]], and
[[https://doc.rust-lang.org/std/io/trait.Write.html][Write]] traits; and Go's [[https://pkg.go.dev/io#Reader][Reader]]
and [[https://pkg.go.dev/io#Writer][Writer]] interfaces.

A design note: in ~iostream~ there is a separation between ~Iostream.In.t~ (which is basically like a unix FD or
rust's ~Read~: it gives you ~read: bytes -> int -> int -> int~), and ~Iostream.In_buf.t~ (the equivalent of rust's
~BufRead~: it has its own buffer and gives you access to it. Unlike ~in_channel~'s magic methods for ~input_line~,
you can inspect the buffer to look ahead and consume exactly the amount of input you need, no leftovers).

The library is under the MIT license. The online docs are
[[https://c-cube.github.io/ocaml-iostream/dev/iostream/index.html][here]].
      

** Rudi Grinberg asked


Looks like an interesting library to me. I have a few comments or questions:

1. Is there going to be support for bigarrays or do you not support them on purpose?
2. The documentation states that ~close~ "must be idempotent" for output streams and is "idempotent" for input streams. Could you clarify the distinction here? Also, did you consider just making sure that your modules never call these functions more than once? Seems like that would be more helpful to users of the library.
3. Did you consider splitting the parts that depend on Unix into a sub library?
      

