2023.09.05.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-05 Tue 10:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2023.08.29.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2023.09.12.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of August 29 to September 05, 2023.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#1">iostream 0.1</a></li>
<li><a href="#2">Second release candidate for OCaml 5.1.0</a></li>
<li><a href="#3">ocamlgraph 2.1.0</a></li>
<li><a href="#4">Liquid ML - A templating language used by Shopify, Github Pages and more!</a></li>
<li><a href="#5">moonpool 0.4</a></li>
<li><a href="#6">Oxidizing OCaml, and a new opam switch</a></li>
<li><a href="#7">Outreachy December 2023</a></li>
<li><a href="#8">New release of PPrint (2023830)</a></li>
<li><a href="#org66df9b8">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="1">iostream 0.1</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-iostream-0-1/12922/1">https://discuss.ocaml.org/t/ann-iostream-0-1/12922/1</a>
</p>
</div>

<div id="outline-container-orge1184b3" class="outline-3">
<h3 id="orge1184b3">Simon Cruanes announced</h3>
<div class="outline-text-3" id="text-orge1184b3">
<p>
I&rsquo;ve just released iostream 0.1. iostream is a <a href="https://github.com/c-cube/ocaml-iostream">library</a> that provides
composable abstractions for input/output streams of bytes. Here composability means that users can create their own
streams, which makes a <code>Iostream.Out.t</code> more powerful than the standard <code>out_channel</code> because it is an abstraction
that might perform compression before writing to a <code>Buffer.t</code>, or writes to a socket, or write nowhere, or send the
bytes to multiple other outputs.
</p>

<p>
There already exist some similar abstractions in the ecosystem, such as Batteries&rsquo; <code>BatIO</code>, an object based version
of this in ocamlnet, and probably uncountably many other projects. I have ancestor versions of this in many of my
own projects. This is my way of dealing with my failure to implement <a href="https://github.com/ocaml/RFCs/pull/19">RFC19</a>
in OCaml itself (a worthy read about tradeoffs and use cases, for anyone interested). In other languages you can
find Rust&rsquo;s <a href="https://doc.rust-lang.org/std/io/trait.Read.html">Read</a>,
<a href="https://doc.rust-lang.org/std/io/trait.BufRead.html">BufRead</a>, and
<a href="https://doc.rust-lang.org/std/io/trait.Write.html">Write</a> traits; and Go&rsquo;s <a href="https://pkg.go.dev/io#Reader">Reader</a>
and <a href="https://pkg.go.dev/io#Writer">Writer</a> interfaces.
</p>

<p>
A design note: in <code>iostream</code> there is a separation between <code>Iostream.In.t</code> (which is basically like a unix FD or
rust&rsquo;s <code>Read</code>: it gives you <code>read: bytes -&gt; int -&gt; int -&gt; int</code>), and <code>Iostream.In_buf.t</code> (the equivalent of rust&rsquo;s
<code>BufRead</code>: it has its own buffer and gives you access to it. Unlike <code>in_channel</code>&rsquo;s magic methods for <code>input_line</code>,
you can inspect the buffer to look ahead and consume exactly the amount of input you need, no leftovers).
</p>

<p>
The library is under the MIT license. The online docs are
<a href="https://c-cube.github.io/ocaml-iostream/dev/iostream/index.html">here</a>.
</p>
</div>
</div>


<div id="outline-container-org7f8fd1d" class="outline-3">
<h3 id="org7f8fd1d">Rudi Grinberg asked</h3>
<div class="outline-text-3" id="text-org7f8fd1d">
<p>
Looks like an interesting library to me. I have a few comments or questions:
</p>

<ol class="org-ol">
<li>Is there going to be support for bigarrays or do you not support them on purpose?</li>
<li>The documentation states that <code>close</code> &ldquo;must be idempotent&rdquo; for output streams and is &ldquo;idempotent&rdquo; for input streams. Could you clarify the distinction here? Also, did you consider just making sure that your modules never call these functions more than once? Seems like that would be more helpful to users of the library.</li>
<li>Did you consider splitting the parts that depend on Unix into a sub library?</li>
</ol>
</div>
</div>
