2023.09.05.txt
                          ━━━━━━━━━━━━━━━━━━━
                           OCAML WEEKLY NEWS
                          ━━━━━━━━━━━━━━━━━━━


[Previous Week] [Up] [Next Week]

Hello

Here is the latest OCaml Weekly News, for the week of August 29 to
September 05, 2023.

Table of Contents
─────────────────

iostream 0.1
Second release candidate for OCaml 5.1.0
ocamlgraph 2.1.0
Liquid ML - A templating language used by Shopify, Github Pages and more!
moonpool 0.4
Oxidizing OCaml, and a new opam switch
Outreachy December 2023
New release of PPrint (2023830)
Old CWN


[Previous Week] <https://alan.petitepomme.net/cwn/2023.08.29.html>

[Up] <https://alan.petitepomme.net/cwn/index.html>

[Next Week] <https://alan.petitepomme.net/cwn/2023.09.12.html>


iostream 0.1
════════════

  Archive: <https://discuss.ocaml.org/t/ann-iostream-0-1/12922/1>


Simon Cruanes announced
───────────────────────

  I’ve just released iostream 0.1. iostream is a [library] that provides
  composable abstractions for input/output streams of bytes. Here
  composability means that users can create their own streams, which
  makes a `Iostream.Out.t' more powerful than the standard `out_channel'
  because it is an abstraction that might perform compression before
  writing to a `Buffer.t', or writes to a socket, or write nowhere, or
  send the bytes to multiple other outputs.

  There already exist some similar abstractions in the ecosystem, such
  as Batteries’ `BatIO', an object based version of this in ocamlnet,
  and probably uncountably many other projects. I have ancestor versions
  of this in many of my own projects. This is my way of dealing with my
  failure to implement [RFC19] in OCaml itself (a worthy read about
  tradeoffs and use cases, for anyone interested). In other languages
  you can find Rust’s [Read], [BufRead], and [Write] traits; and Go’s
  [Reader] and [Writer] interfaces.

  A design note: in `iostream' there is a separation between
  `Iostream.In.t' (which is basically like a unix FD or rust’s `Read':
  it gives you `read: bytes -> int -> int -> int'), and
  `Iostream.In_buf.t' (the equivalent of rust’s `BufRead': it has its
  own buffer and gives you access to it. Unlike `in_channel'’s magic
  methods for `input_line', you can inspect the buffer to look ahead and
  consume exactly the amount of input you need, no leftovers).

  The library is under the MIT license. The online docs are [here].


[library] <https://github.com/c-cube/ocaml-iostream>

[RFC19] <https://github.com/ocaml/RFCs/pull/19>

[Read] <https://doc.rust-lang.org/std/io/trait.Read.html>

[BufRead] <https://doc.rust-lang.org/std/io/trait.BufRead.html>

[Write] <https://doc.rust-lang.org/std/io/trait.Write.html>

[Reader] <https://pkg.go.dev/io#Reader>

[Writer] <https://pkg.go.dev/io#Writer>

[here] <https://c-cube.github.io/ocaml-iostream/dev/iostream/index.html>


Rudi Grinberg asked
───────────────────

  Looks like an interesting library to me. I have a few comments or
  questions:

  1. Is there going to be support for bigarrays or do you not support
     them on purpose?
  2. The documentation states that `close' “must be idempotent” for
     output streams and is “idempotent” for input streams. Could you
     clarify the distinction here? Also, did you consider just making
     sure that your modules never call these functions more than once?
     Seems like that would be more helpful to users of the library.
  3. Did you consider splitting the parts that depend on Unix into a sub
     library?
