2023.09.05.html


<div id="outline-container-org86174c2" class="outline-3">
<h3 id="org86174c2">Simon Cruanes replied</h3>
<div class="outline-text-3" id="text-org86174c2">
<p>
These are good questions, thanks. It&rsquo;s not easy to write interfaces with such a general purpose scope :sweat_smile:
</p>

<ol class="org-ol">
<li>I didn&rsquo;t see a good way to support both bytes and bigarrays in the same interface ­— asking implementors to have both <code>read</code> and <code>read_bigstring</code> would be annoying, for example. However a good chunk of the ecosystem does rely on bigarrays so it is an important topic. I can imagine two solutions on the top of my head:
<ul class="org-ul">
<li>have <code>read_bigstring</code>, <code>write_bigstring</code> with default implementations just going through an intermediate layer of <code>bytes</code>, and the possibility for the implementor of the stream to write a custom version</li>
<li>parametrize the stream types with the underlying type, i.e have <code>bytes Iostream.In.t</code> as well as <code>bigstring ~Iostream.In.t</code>. But here the difficulty is that all the convenience combinators in the library become impossible to write, or specialized just for (say)  the <code>bytes</code> version.</li>
</ul></li>
<li><code>close</code> should be idempotent for both, i.e closing twice shouldn&rsquo;t fail. The reason is that it&rsquo;s just too hard to keep track of whether you closed already, especially if you mix explicit closing (closing a connection) with resource handlers such as <code>with_in : …</code> or <code>Fun.protect</code> that will ensure proper disposal of resources.</li>
<li>How do you provide an interface with a <code>as_fd : unit -&gt; Unix.file_descr option</code> in a sub-library? It has to be part of the core interface, or not be there at all. This part comes from the initial goal, in RFC 19, to replace standard channels (which provide things like <code>seek</code> and <code>pos</code>), but I agree it&rsquo;s annoying to depend on <code>Unix</code>.</li>
</ol>
</div>
</div>
</div>




<div id="outline-container-2" class="outline-2">
<h2 id="2">Second release candidate for OCaml 5.1.0</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/second-release-candidate-for-ocaml-5-1-0/12928/1">https://discuss.ocaml.org/t/second-release-candidate-for-ocaml-5-1-0/12928/1</a>
</p>
</div>

<div id="outline-container-orgb6a8bfe" class="outline-3">
<h3 id="orgb6a8bfe">octachron announced</h3>
<div class="outline-text-3" id="text-orgb6a8bfe">
<p>
In the last two weeks, two significant bugs have been discovered in the release candidate for OCaml 5.1.0 (one
affecting the type system, another in the runtime).
</p>

<p>
Those bugs are now fixed and we are publishing a second release candidate to check that everything is in order
before the release in the upcoming week.
</p>

<p>
If you find any bugs, please report them on <a href="https://github.com/ocaml/ocaml/issues">OCaml&rsquo;s issue tracker</a>.
</p>

<p>
The full change log for OCaml 5.1.0 is available <a href="https://github.com/ocaml/ocaml/blob/5.1/Changes">on GitHub</a>.
A short summary of the two fixed bugs in this release candidate is also available below.
</p>
</div>

<div id="outline-container-org34d60f4" class="outline-4">
<h4 id="org34d60f4">Installation Instructions</h4>
<div class="outline-text-4" id="text-org34d60f4">
<p>
The base compiler can be installed as an opam switch with the following commands on opam 2.1 and later:
</p>
<div class="org-src-container">
<pre class="src src-shell">opam update
opam switch create 5.1.0~rc2
</pre>
</div>

<p>
The source code for the release candidate is also directly available on:
</p>

<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml/archive/5.1.0-rc2.tar.gz">GitHub</a></li>
<li><a href="https://caml.inria.fr/pub/distrib/ocaml-5.1/ocaml-5.1.0~rc2.tar.gz">OCaml archives at Inria</a></li>
</ul>
</div>

<ul class="org-ul">
<li><a id="orgb825166"></a>Fine-Tuned Compiler Configuration<br />
<div class="outline-text-5" id="text-orgb825166">
<p>
If you want to tweak the configuration of the compiler, you can switch to the option variant with:
</p>
<div class="org-src-container">
<pre class="src src-shell">opam update
opam switch create &lt;switch_name&gt; ocaml-variants.5.1.0~rc2+options &lt;option_list&gt;
</pre>
</div>
<p>
where <code>&lt;option_list&gt;</code> is a comma-separated list of <code>ocaml-option-*</code> packages. For instance, for a <code>flambda</code> and
<code>no-flat-float-array</code> switch:
</p>
<div class="org-src-container">
<pre class="src src-shell">opam switch create 5.1.0~rc2+flambda+nffa ocaml-variants.5.1.0~rc2+options ocaml-option-flambda
ocaml-option-no-flat-float-array
</pre>
</div>

<p>
All available options can be listed with <code>opam search ocaml-option</code>.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgd53013b" class="outline-4">
<h4 id="orgd53013b">Last Minute Bug Fixes</h4>
<div class="outline-text-4" id="text-orgd53013b">
</div>
<ul class="org-ul">
<li><a id="orgea91698"></a>Type System:<br />
<div class="outline-text-5" id="text-orgea91698">
<ul class="org-ul">
<li>(<b>breaking change</b>) <a href="https://github.com/ocaml/ocaml/issues/6941">#6941</a>, <a href="https://github.com/ocaml/ocaml/issues/11187">#11187</a>, +<a href="https://github.com/ocaml/ocaml/issues/12483">#12483</a>: prohibit using classes through recursive modules inheriting or including a class belonging to a mutually-recursive module would previous behave incorrectly, and now results in a clean error. (Leo White, review by Gabriel Scherer and Florian Angeletti)</li>
</ul>
</div>
</li>

<li><a id="org663d067"></a>Runtime<br />
<div class="outline-text-5" id="text-org663d067">
<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml/issues/12481">#12481</a>, <a href="https://github.com/ocaml/ocaml/issues/12505">#12505</a>: Fix incorrect initialization of array expressions <code>[|e1;...;eN|]</code> when <code>N</code> is large enough to require major heap allocation. (Xavier Leroy, report by Andrey Popp, analysis by KC Sivaramakrishnan and Vincent Laviron, review by Gabriel Scherer)</li>
</ul>
</div>
</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-3" class="outline-2">
<h2 id="3">ocamlgraph 2.1.0</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-ocamlgraph-2-1-0/12937/1">https://discuss.ocaml.org/t/ann-ocamlgraph-2-1-0/12937/1</a>
</p>
</div>
