2023.09.05.txt


Simon Cruanes replied
─────────────────────

  These are good questions, thanks. It’s not easy to write interfaces
  with such a general purpose scope :sweat_smile:

  1. I didn’t see a good way to support both bytes and bigarrays in the
     same interface ­— asking implementors to have both `read' and
     `read_bigstring' would be annoying, for example. However a good
     chunk of the ecosystem does rely on bigarrays so it is an important
     topic. I can imagine two solutions on the top of my head:
     ‣ have `read_bigstring', `write_bigstring' with default
       implementations just going through an intermediate layer of
       `bytes', and the possibility for the implementor of the stream to
       write a custom version
     ‣ parametrize the stream types with the underlying type, i.e have
       `bytes Iostream.In.t' as well as `bigstring ~Iostream.In.t'. But
       here the difficulty is that all the convenience combinators in
       the library become impossible to write, or specialized just for
       (say) the `bytes' version.
  2. `close' should be idempotent for both, i.e closing twice shouldn’t
     fail. The reason is that it’s just too hard to keep track of
     whether you closed already, especially if you mix explicit closing
     (closing a connection) with resource handlers such as `with_in : …'
     or `Fun.protect' that will ensure proper disposal of resources.
  3. How do you provide an interface with a `as_fd : unit ->
     Unix.file_descr option' in a sub-library? It has to be part of the
     core interface, or not be there at all. This part comes from the
     initial goal, in RFC 19, to replace standard channels (which
     provide things like `seek' and `pos'), but I agree it’s annoying to
     depend on `Unix'.


Second release candidate for OCaml 5.1.0
════════════════════════════════════════

  Archive:
  <https://discuss.ocaml.org/t/second-release-candidate-for-ocaml-5-1-0/12928/1>


octachron announced
───────────────────

  In the last two weeks, two significant bugs have been discovered in
  the release candidate for OCaml 5.1.0 (one affecting the type system,
  another in the runtime).

  Those bugs are now fixed and we are publishing a second release
  candidate to check that everything is in order before the release in
  the upcoming week.

  If you find any bugs, please report them on [OCaml’s issue tracker].

  The full change log for OCaml 5.1.0 is available [on GitHub]. A short
  summary of the two fixed bugs in this release candidate is also
  available below.


[OCaml’s issue tracker] <https://github.com/ocaml/ocaml/issues>

[on GitHub] <https://github.com/ocaml/ocaml/blob/5.1/Changes>

Installation Instructions
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  The base compiler can be installed as an opam switch with the
  following commands on opam 2.1 and later:
  ┌────
  │ opam update
  │ opam switch create 5.1.0~rc2
  └────

  The source code for the release candidate is also directly available
  on:

  • [GitHub]
  • [OCaml archives at Inria]


[GitHub] <https://github.com/ocaml/ocaml/archive/5.1.0-rc2.tar.gz>

[OCaml archives at Inria]
<https://caml.inria.fr/pub/distrib/ocaml-5.1/ocaml-5.1.0~rc2.tar.gz>

◊ Fine-Tuned Compiler Configuration

  If you want to tweak the configuration of the compiler, you can switch
  to the option variant with:
  ┌────
  │ opam update
  │ opam switch create <switch_name> ocaml-variants.5.1.0~rc2+options <option_list>
  └────
  where `<option_list>' is a comma-separated list of `ocaml-option-*'
  packages. For instance, for a `flambda' and `no-flat-float-array'
  switch:
  ┌────
  │ opam switch create 5.1.0~rc2+flambda+nffa ocaml-variants.5.1.0~rc2+options ocaml-option-flambda
  │ ocaml-option-no-flat-float-array
  └────

  All available options can be listed with `opam search ocaml-option'.


Last Minute Bug Fixes
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

◊ Type System:

  • (*breaking change*) [#6941], [#11187], +[#12483]: prohibit using
    classes through recursive modules inheriting or including a class
    belonging to a mutually-recursive module would previous behave
    incorrectly, and now results in a clean error. (Leo White, review by
    Gabriel Scherer and Florian Angeletti)


  [#6941] <https://github.com/ocaml/ocaml/issues/6941>

  [#11187] <https://github.com/ocaml/ocaml/issues/11187>

  [#12483] <https://github.com/ocaml/ocaml/issues/12483>


◊ Runtime

  • [#12481], [#12505]: Fix incorrect initialization of array
    expressions `[|e1;...;eN|]' when `N' is large enough to require
    major heap allocation. (Xavier Leroy, report by Andrey Popp,
    analysis by KC Sivaramakrishnan and Vincent Laviron, review by
    Gabriel Scherer)


  [#12481] <https://github.com/ocaml/ocaml/issues/12481>

  [#12505] <https://github.com/ocaml/ocaml/issues/12505>


ocamlgraph 2.1.0
════════════════

  Archive: <https://discuss.ocaml.org/t/ann-ocamlgraph-2-1-0/12937/1>
