2023.09.05.org
** Jean Christophe Filliatre announced


It is my pleasure to announce a new release of [[https://github.com/backtracking/ocamlgraph][OCamlGraph]], a graph
library for OCaml. It is already available in opam and it is documented
[[http://backtracking.github.io/ocamlgraph/][here]].

Among other things, this release fixes an embarrassing bug in functions ~Dfs.fold~ and ~Dfs.fold_component~, which
were actually not implementing a depth-first traversal (yet a graph traversal). See the excellent post [[https://11011110.github.io/blog/2013/12/17/stack-based-graph-traversal.html][Stack-based
DFS is tricky to get right]] for an
explanation.

Note: We have deprecated the support of package ~ocamlgraph_gtk~, a tool to display graphs using GTK. If you are
using this package, please [[https://github.com/backtracking/ocamlgraph/issues][make an issue]] and we'll discuss the
options.
      



* Liquid ML - A templating language used by Shopify, Github Pages and more!
:PROPERTIES:
:CUSTOM_ID: 4
:END:
Archive: https://discuss.ocaml.org/t/ann-liquid-ml-a-templating-language-used-by-shopify-github-pages-and-more/12940/1

** Ben Faerber announced


Hello everyone, I am excited to announce the release of my first OPAM package liquid_ml. Shopify's Liquid
Templating language for OCaml. Check it out here:
[[https://github.com/benfaerber/liquid-ml][https://github.com/benfaerber/liquid-ml]]

Learn Liquid syntax here: [[https://shopify.github.io/liquid/][https://shopify.github.io/liquid/]]

The Liquid templating language is used all over including Shopify and Github pages. The Rust port of the language
is very popular for static site and documentation generation. If anyone has any suggestions or wants to help
improve the project I welcome pull requests!
      



* moonpool 0.4
:PROPERTIES:
:CUSTOM_ID: 5
:END:
Archive: https://discuss.ocaml.org/t/ann-moonpool-0-4/12941/1

** Simon Cruanes announced


Moonpool [[https://github.com/c-cube/moonpool/releases/tag/v0.4][0.4]] was released on opam a few days ago.

There are not a lot of new features, but Moonpool is now a better citizen wrt resource usage: if no pool is active,
background domains will shut down (to be spun back again later if they're needed). This was trickier to get right
than I expected and a last bug was found [[https://github.com/ocaml/opam-repository/pull/24306][during the release
process]] and fixed with the help of @avsm, @dra27 and [[https://github.com/mtelvers][Mark
Telvers]]).
      



* Oxidizing OCaml, and a new opam switch
:PROPERTIES:
:CUSTOM_ID: 6
:END:
Archive: https://discuss.ocaml.org/t/oxidizing-ocaml-and-a-new-opam-switch/12942/1

** Yaron Minsky announced


We just posted the thrilling conclusion to our blog trilogy on Oxidizing OCaml, which talks about some of the
things we've been working on (and some of our space-age plans) around extending OCaml to support some of the same
kinds of things that Rust lets you do, but in a distinctly OCaml-ish way.

Here are the posts:

- [[https://blog.janestreet.com/oxidizing-ocaml-locality/][Locality]]
- [[https://blog.janestreet.com/oxidizing-ocaml-ownership/][Rust Style Ownership]]
- [[https://blog.janestreet.com/oxidizing-ocaml-parallelism/][Data Race Freedom]]

Maybe more excitingly, you can play around with the version of our internal compiler that has the bits of this
we've implemented thus far (mostly, the local/global stuff, but the beginnings of uniqueness as well) as well as
our open-source libraries, via an [[https://github.com/janestreet/opam-repository/tree/with-extensions][opam
switch]].

This is very much a bleeding-edge, unstable version. We use it internally for real work, but we refactor it
mercilessly, and the language features are most definitely not stable. We hope one day to propose a lot of this
upstream, but for now, it's just a preview of some interesting experiments.

The thing I'm most excited about all of this is the prospect of data-race free OCaml. The ability to leverage the
great work done by the Multicore team, but safely, is a prospect I'm very much looking forward to.

Also, a bunch of Jane Street compiler folk will be at ICFP next week. If you're interested in learning more, that's
a good time to grab one of us.
      



* Outreachy December 2023
:PROPERTIES:
:CUSTOM_ID: 7
:END:
Archive: https://discuss.ocaml.org/t/outreachy-december-2023/12949/1

