2023.09.05.html

<div id="outline-container-org08452cf" class="outline-3">
<h3 id="org08452cf">Jean Christophe Filliatre announced</h3>
<div class="outline-text-3" id="text-org08452cf">
<p>
It is my pleasure to announce a new release of <a href="https://github.com/backtracking/ocamlgraph">OCamlGraph</a>, a graph
library for OCaml. It is already available in opam and it is documented
<a href="http://backtracking.github.io/ocamlgraph/">here</a>.
</p>

<p>
Among other things, this release fixes an embarrassing bug in functions <code>Dfs.fold</code> and <code>Dfs.fold_component</code>, which
were actually not implementing a depth-first traversal (yet a graph traversal). See the excellent post <a href="https://11011110.github.io/blog/2013/12/17/stack-based-graph-traversal.html">Stack-based
DFS is tricky to get right</a> for an
explanation.
</p>

<p>
Note: We have deprecated the support of package <code>ocamlgraph_gtk</code>, a tool to display graphs using GTK. If you are
using this package, please <a href="https://github.com/backtracking/ocamlgraph/issues">make an issue</a> and we&rsquo;ll discuss the
options.
</p>
</div>
</div>
</div>




<div id="outline-container-4" class="outline-2">
<h2 id="4">Liquid ML - A templating language used by Shopify, Github Pages and more!</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-liquid-ml-a-templating-language-used-by-shopify-github-pages-and-more/12940/1">https://discuss.ocaml.org/t/ann-liquid-ml-a-templating-language-used-by-shopify-github-pages-and-more/12940/1</a>
</p>
</div>

<div id="outline-container-org818d265" class="outline-3">
<h3 id="org818d265">Ben Faerber announced</h3>
<div class="outline-text-3" id="text-org818d265">
<p>
Hello everyone, I am excited to announce the release of my first OPAM package liquid_ml. Shopify&rsquo;s Liquid
Templating language for OCaml. Check it out here:
<a href="https://github.com/benfaerber/liquid-ml">https://github.com/benfaerber/liquid-ml</a>
</p>

<p>
Learn Liquid syntax here: <a href="https://shopify.github.io/liquid/">https://shopify.github.io/liquid/</a>
</p>

<p>
The Liquid templating language is used all over including Shopify and Github pages. The Rust port of the language
is very popular for static site and documentation generation. If anyone has any suggestions or wants to help
improve the project I welcome pull requests!
</p>
</div>
</div>
</div>




<div id="outline-container-5" class="outline-2">
<h2 id="5">moonpool 0.4</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-moonpool-0-4/12941/1">https://discuss.ocaml.org/t/ann-moonpool-0-4/12941/1</a>
</p>
</div>

<div id="outline-container-orgc8373fc" class="outline-3">
<h3 id="orgc8373fc">Simon Cruanes announced</h3>
<div class="outline-text-3" id="text-orgc8373fc">
<p>
Moonpool <a href="https://github.com/c-cube/moonpool/releases/tag/v0.4">0.4</a> was released on opam a few days ago.
</p>

<p>
There are not a lot of new features, but Moonpool is now a better citizen wrt resource usage: if no pool is active,
background domains will shut down (to be spun back again later if they&rsquo;re needed). This was trickier to get right
than I expected and a last bug was found <a href="https://github.com/ocaml/opam-repository/pull/24306">during the release
process</a> and fixed with the help of @avsm, @dra27 and <a href="https://github.com/mtelvers">Mark
Telvers</a>).
</p>
</div>
</div>
</div>




<div id="outline-container-6" class="outline-2">
<h2 id="6">Oxidizing OCaml, and a new opam switch</h2>
<div class="outline-text-2" id="text-6">
<p>
Archive: <a href="https://discuss.ocaml.org/t/oxidizing-ocaml-and-a-new-opam-switch/12942/1">https://discuss.ocaml.org/t/oxidizing-ocaml-and-a-new-opam-switch/12942/1</a>
</p>
</div>

<div id="outline-container-orgbf25e63" class="outline-3">
<h3 id="orgbf25e63">Yaron Minsky announced</h3>
<div class="outline-text-3" id="text-orgbf25e63">
<p>
We just posted the thrilling conclusion to our blog trilogy on Oxidizing OCaml, which talks about some of the
things we&rsquo;ve been working on (and some of our space-age plans) around extending OCaml to support some of the same
kinds of things that Rust lets you do, but in a distinctly OCaml-ish way.
</p>

<p>
Here are the posts:
</p>

<ul class="org-ul">
<li><a href="https://blog.janestreet.com/oxidizing-ocaml-locality/">Locality</a></li>
<li><a href="https://blog.janestreet.com/oxidizing-ocaml-ownership/">Rust Style Ownership</a></li>
<li><a href="https://blog.janestreet.com/oxidizing-ocaml-parallelism/">Data Race Freedom</a></li>
</ul>

<p>
Maybe more excitingly, you can play around with the version of our internal compiler that has the bits of this
we&rsquo;ve implemented thus far (mostly, the local/global stuff, but the beginnings of uniqueness as well) as well as
our open-source libraries, via an <a href="https://github.com/janestreet/opam-repository/tree/with-extensions">opam
switch</a>.
</p>

<p>
This is very much a bleeding-edge, unstable version. We use it internally for real work, but we refactor it
mercilessly, and the language features are most definitely not stable. We hope one day to propose a lot of this
upstream, but for now, it&rsquo;s just a preview of some interesting experiments.
</p>

<p>
The thing I&rsquo;m most excited about all of this is the prospect of data-race free OCaml. The ability to leverage the
great work done by the Multicore team, but safely, is a prospect I&rsquo;m very much looking forward to.
</p>

<p>
Also, a bunch of Jane Street compiler folk will be at ICFP next week. If you&rsquo;re interested in learning more, that&rsquo;s
a good time to grab one of us.
</p>
</div>
</div>
</div>




<div id="outline-container-7" class="outline-2">
<h2 id="7">Outreachy December 2023</h2>
<div class="outline-text-2" id="text-7">
<p>
Archive: <a href="https://discuss.ocaml.org/t/outreachy-december-2023/12949/1">https://discuss.ocaml.org/t/outreachy-december-2023/12949/1</a>
</p>
</div>
