2023.09.05.txt


Jean Christophe Filliatre announced
───────────────────────────────────

  It is my pleasure to announce a new release of [OCamlGraph], a graph
  library for OCaml. It is already available in opam and it is
  documented [here].

  Among other things, this release fixes an embarrassing bug in
  functions `Dfs.fold' and `Dfs.fold_component', which were actually not
  implementing a depth-first traversal (yet a graph traversal). See the
  excellent post [Stack-based DFS is tricky to get right] for an
  explanation.

  Note: We have deprecated the support of package `ocamlgraph_gtk', a
  tool to display graphs using GTK. If you are using this package,
  please [make an issue] and we’ll discuss the options.


[OCamlGraph] <https://github.com/backtracking/ocamlgraph>

[here] <http://backtracking.github.io/ocamlgraph/>

[Stack-based DFS is tricky to get right]
<https://11011110.github.io/blog/2013/12/17/stack-based-graph-traversal.html>

[make an issue] <https://github.com/backtracking/ocamlgraph/issues>


Liquid ML - A templating language used by Shopify, Github Pages and more!
═════════════════════════════════════════════════════════════════════════

  Archive:
  <https://discuss.ocaml.org/t/ann-liquid-ml-a-templating-language-used-by-shopify-github-pages-and-more/12940/1>


Ben Faerber announced
─────────────────────

  Hello everyone, I am excited to announce the release of my first OPAM
  package liquid_ml. Shopify’s Liquid Templating language for OCaml.
  Check it out here: [https://github.com/benfaerber/liquid-ml]

  Learn Liquid syntax here: [https://shopify.github.io/liquid/]

  The Liquid templating language is used all over including Shopify and
  Github pages. The Rust port of the language is very popular for static
  site and documentation generation. If anyone has any suggestions or
  wants to help improve the project I welcome pull requests!


[https://github.com/benfaerber/liquid-ml]
<https://github.com/benfaerber/liquid-ml>

[https://shopify.github.io/liquid/] <https://shopify.github.io/liquid/>


moonpool 0.4
════════════

  Archive: <https://discuss.ocaml.org/t/ann-moonpool-0-4/12941/1>


Simon Cruanes announced
───────────────────────

  Moonpool [0.4] was released on opam a few days ago.

  There are not a lot of new features, but Moonpool is now a better
  citizen wrt resource usage: if no pool is active, background domains
  will shut down (to be spun back again later if they’re needed). This
  was trickier to get right than I expected and a last bug was found
  [during the release process] and fixed with the help of @avsm, @dra27
  and [Mark Telvers]).


[0.4] <https://github.com/c-cube/moonpool/releases/tag/v0.4>

[during the release process]
<https://github.com/ocaml/opam-repository/pull/24306>

[Mark Telvers] <https://github.com/mtelvers>


Oxidizing OCaml, and a new opam switch
══════════════════════════════════════

  Archive:
  <https://discuss.ocaml.org/t/oxidizing-ocaml-and-a-new-opam-switch/12942/1>


Yaron Minsky announced
──────────────────────

  We just posted the thrilling conclusion to our blog trilogy on
  Oxidizing OCaml, which talks about some of the things we’ve been
  working on (and some of our space-age plans) around extending OCaml to
  support some of the same kinds of things that Rust lets you do, but in
  a distinctly OCaml-ish way.

  Here are the posts:

  • [Locality]
  • [Rust Style Ownership]
  • [Data Race Freedom]

  Maybe more excitingly, you can play around with the version of our
  internal compiler that has the bits of this we’ve implemented thus far
  (mostly, the local/global stuff, but the beginnings of uniqueness as
  well) as well as our open-source libraries, via an [opam switch].

  This is very much a bleeding-edge, unstable version. We use it
  internally for real work, but we refactor it mercilessly, and the
  language features are most definitely not stable. We hope one day to
  propose a lot of this upstream, but for now, it’s just a preview of
  some interesting experiments.

  The thing I’m most excited about all of this is the prospect of
  data-race free OCaml. The ability to leverage the great work done by
  the Multicore team, but safely, is a prospect I’m very much looking
  forward to.

  Also, a bunch of Jane Street compiler folk will be at ICFP next week.
  If you’re interested in learning more, that’s a good time to grab one
  of us.


[Locality] <https://blog.janestreet.com/oxidizing-ocaml-locality/>

[Rust Style Ownership]
<https://blog.janestreet.com/oxidizing-ocaml-ownership/>

[Data Race Freedom]
<https://blog.janestreet.com/oxidizing-ocaml-parallelism/>

[opam switch]
<https://github.com/janestreet/opam-repository/tree/with-extensions>


Outreachy December 2023
═══════════════════════

  Archive: <https://discuss.ocaml.org/t/outreachy-december-2023/12949/1>
