2023.09.05.html

<div id="outline-container-org1dc4bc2" class="outline-3">
<h3 id="org1dc4bc2">Patrick Ferris announced</h3>
<div class="outline-text-3" id="text-org1dc4bc2">
<p>
With the conclusion of the previous Outreachy round (see
<a href="https://discuss.ocaml.org/t/end-of-internship-demo-session/12927/">https://discuss.ocaml.org/t/end-of-internship-demo-session/12927/</a>), the next round is fast approaching and the
OCaml community has signed up again to participate!
</p>

<p>
The deadline for mentors to <a href="https://www.outreachy.org/communities/cfp/">signup</a> is <b>September 29 2023</b>. The
OCaml community has decided to try a slightly different approach that has worked very well in the previous round.
We noticed quite a few people would like to be involved in an internship but without worrying too much about the
details of Outreachy itself. If people are simply interested in mentoring and they maintain an open-source project,
then they can reach out directly to @pitag or myself and we can help scope a project, explain the contribution
period and provide as much other help as we can!
</p>

<p>
When signing up mentors propose an open-source project where prospective interns submit PRs during the
&ldquo;contribution phases&rdquo; as part of their application. Mentors will then choose an intern to work with for 3 months. A
more detailed explanation is available <a href="https://www.outreachy.org/mentor/#mentor">on the Outreachy mentor section</a>.
</p>

<p>
Finally, <a href="https://tarides.com">Tarides</a> and <a href="https://ocaml-sf.org">OCaml Software Foundation</a> have been very
generous so far funding our efforts on the intern side. Since the previous round, Jane Street and Tarides have gone
a step further and have also provided funding for the mentor side! Mentoring does take time, but you get a lot back
from it on different levels and hopefully this financial help can lower the barriers to being a mentor.
</p>

<p>
As always if you have any general questions or mentoring ideas do comment on this thread or reach out to us
directly.
</p>
</div>
</div>
</div>




<div id="outline-container-8" class="outline-2">
<h2 id="8">New release of PPrint (2023830)</h2>
<div class="outline-text-2" id="text-8">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-new-release-of-pprint-2023830/12954/1">https://discuss.ocaml.org/t/ann-new-release-of-pprint-2023830/12954/1</a>
</p>
</div>

<div id="outline-container-orga29dd25" class="outline-3">
<h3 id="orga29dd25">François Pottier announced</h3>
<div class="outline-text-3" id="text-orga29dd25">
<p>
It is my pleasure to announce a new release of PPrint, the pretty-printing library, with the following additions:
</p>

<ul class="org-ul">
<li>The new function <code>is_empty</code> allows testing (in constant time) whether
a document is empty.</li>
<li>Documentation: add a warning about the time and space complexity of
a naive use of <code>ifflat</code>.</li>
</ul>

<p>
The library now requires OCaml 4.03 or newer.
</p>
</div>
</div>
</div>




<div id="outline-container-org66df9b8" class="outline-2">
<h2 id="org66df9b8">Old CWN</h2>
<div class="outline-text-2" id="text-org66df9b8">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I&rsquo;ll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe <a href="http://lists.idyll.org/listinfo/caml-news-weekly/">online</a>.
</p>

<div class="authorname" id="org3a67638">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>