2023.09.05.txt


Patrick Ferris announced
────────────────────────

  With the conclusion of the previous Outreachy round (see
  <https://discuss.ocaml.org/t/end-of-internship-demo-session/12927/>),
  the next round is fast approaching and the OCaml community has signed
  up again to participate!

  The deadline for mentors to [signup] is *September 29 2023*. The OCaml
  community has decided to try a slightly different approach that has
  worked very well in the previous round. We noticed quite a few people
  would like to be involved in an internship but without worrying too
  much about the details of Outreachy itself. If people are simply
  interested in mentoring and they maintain an open-source project, then
  they can reach out directly to @pitag or myself and we can help scope
  a project, explain the contribution period and provide as much other
  help as we can!

  When signing up mentors propose an open-source project where
  prospective interns submit PRs during the “contribution phases” as
  part of their application. Mentors will then choose an intern to work
  with for 3 months. A more detailed explanation is available [on the
  Outreachy mentor section].

  Finally, [Tarides] and [OCaml Software Foundation] have been very
  generous so far funding our efforts on the intern side. Since the
  previous round, Jane Street and Tarides have gone a step further and
  have also provided funding for the mentor side! Mentoring does take
  time, but you get a lot back from it on different levels and hopefully
  this financial help can lower the barriers to being a mentor.

  As always if you have any general questions or mentoring ideas do
  comment on this thread or reach out to us directly.


[signup] <https://www.outreachy.org/communities/cfp/>

[on the Outreachy mentor section]
<https://www.outreachy.org/mentor/#mentor>

[Tarides] <https://tarides.com>

[OCaml Software Foundation] <https://ocaml-sf.org>


New release of PPrint (2023830)
═══════════════════════════════

  Archive:
  <https://discuss.ocaml.org/t/ann-new-release-of-pprint-2023830/12954/1>


François Pottier announced
──────────────────────────

  It is my pleasure to announce a new release of PPrint, the
  pretty-printing library, with the following additions:

  • The new function `is_empty' allows testing (in constant time)
    whether a document is empty.
  • Documentation: add a warning about the time and space complexity of
    a naive use of `ifflat'.

  The library now requires OCaml 4.03 or newer.


Old CWN
═══════

  If you happen to miss a CWN, you can [send me a message] and I’ll mail
  it to you, or go take a look at [the archive] or the [RSS feed of the
  archives].

  If you also wish to receive it every week by mail, you may subscribe
  [online].

  [Alan Schmitt]


[send me a message] <mailto:alan.schmitt@polytechnique.org>

[the archive] <https://alan.petitepomme.net/cwn/>

[RSS feed of the archives] <https://alan.petitepomme.net/cwn/cwn.rss>

[online] <http://lists.idyll.org/listinfo/caml-news-weekly/>

[Alan Schmitt] <https://alan.petitepomme.net/>
